base/InformationRegisters/СостоянияОбменовССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОбменовССайтом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатВыполненияОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыОбменаССайтом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаОбменаССайтом</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменССайтом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеПриОбмене</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПриОбменеССайтом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/СостоянияОбменовДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОбменовДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатВыполненияОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыполненияОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеПриОбмене</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПриОбмене</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/УспешныеОбменыССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УспешныеОбменыССайтом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаОбменаССайтом</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменССайтом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеПриОбмене</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПриОбменеССайтом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/СостоянияОбменовССайтом/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСостоянияОбменовССайтами() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбменССайтом.Ссылка КАК Настройка
	|ИЗ
	|	ПланОбмена.ОбменССайтом КАК ОбменССайтом
	|ГДЕ
	|	 НЕ ОбменССайтом.Ссылка = &ЭтотУзел";
	
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменССайтом.ЭтотУзел());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		НаборЗаписейОбменДанными = РегистрыСведений.СостоянияОбменовДанными.СоздатьНаборЗаписей();
		НаборЗаписейОбменДанными.Отбор.УзелИнформационнойБазы.Установить(Выборка.Настройка);
		НаборЗаписейОбменДанными.Прочитать();
		
		НаборЗаписейОбменССайтом = СоздатьНаборЗаписей(); // РегистрыСведений.СостоянияОбменовССайтом избыточно
		НаборЗаписейОбменССайтом.Отбор.НастройкаОбменаССайтом.Установить(Выборка.Настройка);
		НаборЗаписейОбменССайтом.Прочитать();
		
		Для Каждого ЗаписьОбменаДанными Из НаборЗаписейОбменДанными Цикл
			
			ЗаписьОбменаССайтом = НаборЗаписейОбменССайтом.Добавить();
			 
			ЗаполнитьЗначенияСвойств(ЗаписьОбменаССайтом, ЗаписьОбменаДанными);
			
			ЗаписьОбменаССайтом.НастройкаОбменаССайтом = ЗаписьОбменаДанными.УзелИнформационнойБазы;
			
			Если ЗаписьОбменаДанными.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных Тогда
				ДействиеПриОбмене = Перечисления.ДействияПриОбменеССайтом.ВыгрузкаДанных;
			ИначеЕсли ЗаписьОбменаДанными.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ЗагрузкаДанных Тогда
				ДействиеПриОбмене = Перечисления.ДействияПриОбменеССайтом.ЗагрузкаДанных;
			КонецЕсли;
			ЗаписьОбменаССайтом.ДействиеПриОбмене = ДействиеПриОбмене;
			
			Если ЗаписьОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено Тогда
				Результат = Перечисления.РезультатыОбменаССайтом.Выполнено;
			ИначеЕсли ЗаписьОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.ВыполненоСПредупреждениями Тогда
				Результат = Перечисления.РезультатыОбменаССайтом.ВыполненоСПредупреждениями;
			ИначеЕсли ЗаписьОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Ошибка Тогда
				Результат = Перечисления.РезультатыОбменаССайтом.Ошибка;
			КонецЕсли;
			ЗаписьОбменаССайтом.РезультатВыполненияОбмена = Результат;
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейОбменССайтом, Истина, Ложь, Ложь);
		
		НаборЗаписейОбменДанными.Очистить();
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейОбменДанными, Истина, Ложь, Ложь);
		
		НаборЗаписейСостоянияУспешныхОбменов = РегистрыСведений.СостоянияУспешныхОбменовДанными.СоздатьНаборЗаписей();
		НаборЗаписейСостоянияУспешныхОбменов.Отбор.УзелИнформационнойБазы.Установить(Выборка.Настройка);
		НаборЗаписейСостоянияУспешныхОбменов.Прочитать();
		
		НаборЗаписейУспешныеОбменыССайтом = РегистрыСведений.УспешныеОбменыССайтом.СоздатьНаборЗаписей();
		НаборЗаписейУспешныеОбменыССайтом.Отбор.НастройкаОбменаССайтом.Установить(Выборка.Настройка);
		НаборЗаписейУспешныеОбменыССайтом.Прочитать();
		
		Для Каждого ЗаписьОбменаДанными Из НаборЗаписейСостоянияУспешныхОбменов Цикл
			
			ЗаписьОбменаССайтом = НаборЗаписейУспешныеОбменыССайтом.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьОбменаССайтом, ЗаписьОбменаДанными);
			
			ЗаписьОбменаССайтом.НастройкаОбменаССайтом = ЗаписьОбменаДанными.УзелИнформационнойБазы;
			
			Если ЗаписьОбменаДанными.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных Тогда
				ДействиеПриОбмене = Перечисления.ДействияПриОбменеССайтом.ВыгрузкаДанных;
			ИначеЕсли ЗаписьОбменаДанными.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ЗагрузкаДанных Тогда
				ДействиеПриОбмене = Перечисления.ДействияПриОбменеССайтом.ЗагрузкаДанных;
			КонецЕсли;
			ЗаписьОбменаССайтом.ДействиеПриОбмене = ДействиеПриОбмене;
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейУспешныеОбменыССайтом, Истина, Ложь, Ложь);
		
		НаборЗаписейСостоянияУспешныхОбменов.Очистить();
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейСостоянияУспешныхОбменов, Истина, Ложь, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
